Stray8/stm32_smart_teach/Software/stm32/103c8t6/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED1_Pin GPIO_PIN_13
#define LED1_GPIO_Port GPIOC
#define Key_1_Pin GPIO_PIN_4
#define Key_1_GPIO_Port GPIOA
#define Key_1_EXTI_IRQn EXTI4_IRQn
#define Key_2_Pin GPIO_PIN_5
#define Key_2_GPIO_Port GPIOA
#define Key_2_EXTI_IRQn EXTI9_5_IRQn
#define Key_3_Pin GPIO_PIN_6
#define Key_3_GPIO_Port GPIOA
#define Key_3_EXTI_IRQn EXTI9_5_IRQn
#define Key_4_Pin GPIO_PIN_7
#define Key_4_GPIO_Port GPIOA
#define Key_4_EXTI_IRQn EXTI9_5_IRQn
#define LED_yellow_Pin GPIO_PIN_13
#define LED_yellow_GPIO_Port GPIOB
#define LED_white_Pin GPIO_PIN_14
#define LED_white_GPIO_Port GPIOB
#define LED_red_Pin GPIO_PIN_15
#define LED_red_GPIO_Port GPIOB
#define TTP_223_Pin GPIO_PIN_8
#define TTP_223_GPIO_Port GPIOA
#define TTP_223_EXTI_IRQn EXTI9_5_IRQn
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
